### [문제 1]

In [1]:
import pandas as pd
midwest = pd.read_csv('midwest.csv')

In [2]:
midwest['ratio'] = (midwest['poptotal'] - midwest['popadults']) / midwest['poptotal'] * 100

### [문제 2]

In [6]:
midwest.sort_values('ratio', ascending = False)\
       .head()[['county', 'ratio']]

        county      ratio
230   ISABELLA  51.501172
404  MENOMINEE  50.591260
281     ATHENS  49.320727
247    MECOSTA  49.059183
154     MONROE  47.358182

### [문제 3]

In [7]:
import numpy as np

In [8]:
midwest['grade'] = np.where(midwest['ratio']>=40, 'large', 
                   np.where(midwest['ratio']>=30, 'middle', 'small'))

In [12]:
# 방법 1
midwest.groupby('grade')\
       .agg(n = ('grade', 'count'))

          n
grade
large    32
middle  396
small     9

In [11]:
# 방법 2
midwest['grade'].value_counts()

grade
middle    396
large      32
small       9
Name: count, dtype: int64

### [문제 4]

In [15]:
# 백분율 변수 추가
# 내림차순 정렬
# 상위 10행 출력
# 변수 추출
midwest.assign(ratio_asian = midwest['popasian'] / midwest['poptotal'] * 100)\
       .sort_values('ratio_asian')\
       .head(10)[['state', 'county', 'ratio_asian']]

    state     county  ratio_asian
404    WI  MENOMINEE     0.000000
105    IN     BENTON     0.010592
109    IN    CARROLL     0.015950
358    OH     VINTON     0.027032
390    WI       IRON     0.032504
85     IL      SCOTT     0.053154
112    IN       CLAY     0.060716
261    MI     OSCODA     0.063759
340    OH      PERRY     0.066546
73     IL      PIATT     0.070749